import React from "react";

function DisignMaket() {
  return (
    <>
      <section id="disignmaket" className="disignmaket">
        <div className="container__disign">
          <h2 className="text-center mb-0">Дизайн макета в Figma</h2>
          <p className="text-center ">дизайн интерфейса сайта</p>

          <div className="row">
            <div className="col-md-6">
              <p className="p-2">
                Создание дизайн-макета сайта в Figma — это увлекательный
                процесс, в котором архитектура идей встречается с визуальным
                искусством. В самом начале стоит определиться с концепцией и
                целевой аудиторией, что поможет установить правильные акценты.
                </p>
                <p className="p-2">
                Затем, наполняясь вдохновением, мы приступаем к проектированию
                вайрфреймов — черно-белых каркасных набросков, которые дают
                общее представление о структуре страницы.
              </p>
              <p className="p-2">
                Далее начинается работа с элементами интерфейса: мы подбираем
                шрифты, палитры цветов и графику, чтобы сформировать единый
                стиль. </p>
               
            </div>
            <div className="col-md-6">
            <p className="p-2">Особое внимание уделяется пользовательскому опыту —
                удобству навигации и гармонии визуальных компонентов. Применяя
                стили и компоненты, мы создаем адаптивные элементы, которые
                будут отлично смотреться на различных устройствах.
              </p>
              <p className="p-2">
                Финальная стадия — это полировка макета: мы добавляем анимации,
                взаимодействия и, возможно, элементы прототипирования, которые
                предвосхищают будущую жизнь сайта.</p>
                <p className="p-2"> После этого можно делиться
                результатами с командой, получать обратную связь и вносить
                финальные правки. На выходе мы получаем не просто картинку, а
                полноценную визуализацию, которая станет основой для разработки.
              </p>
              <p className="p-2"></p>
            </div>
          </div>
        </div>
      </section>

      {/* <section id="disignmaket" className="disign">
        <div className="container__disign">
          <h2 className="text-center mb-0">Дизайн макета</h2>
          <p className="text-center ">дизайн интерфейса сайта</p>

          <div className="row">
            <div className="col-md-6"></div>
            <div className="col-md-6"></div>
          </div>
        </div>
      </section> */}
    </>
  );
}

export default DisignMaket;
